# Задача 1
# Поработайте с переменными, создайте несколько, выведите на экран.
# Запросите у пользователя некоторые числа и строки и сохраните в переменные, затем выведите на экран.

a = 10
b = 'ok'
c = 555
d = c != 555

print('a =', a, '  type:', type(a))
print('b =', b, '  type:', type(b))
print('c =', c, '  type:', type(c))
print('d =', d, '  type:', type(d))
e = input('Введите e: ')
print('e =', e, '  type:', type(e))

print('_________')
